import random
import time

class Warrior:
    def __init__(self, name):
        self.name = name
        self.health = 100

    def attack(self, enemy):
        print(f"{self.name} атакует {enemy.name}а!")
        enemy.health -= 20
        if enemy.health <= 0:
            print(f"{enemy.name} проиграл!")
            return False
        else:
            print(f"У {enemy.name} осталось {enemy.health} здоровья.")
            return True
b = """
\033[96m
 ______               _                _____      _________   _____  _____   _______      ______       ___    
|_   _ `.            / |_             / ___ `.   |  _   _  | |_   _||_   _| |_   __ \    |_   _ \    .'   `.  
  | | `. \   .--.   `| |-'  ,--.     |_/___) |   |_/ | | \_|   | |    | |     | |__) |     | |_) |  /  .-.  \ 
  | |  | | / .'`\ \  | |   `'_\ :     .'____.'       | |       | '    ' |     |  __ /      |  __'.  | |   | | 
 _| |_.' / | \__. |  | |,  // | |,   / /_____       _| |_       \ \__/ /     _| |  \ \_   _| |__) | \  `-'  / 
|______.'   '.__.'   \__/  \'-;__/   |_______|     |_____|       `.__.'     |____| |___| |_______/   `.___.'                                                                                                                
\033[0m
"""
a = """
\033[95m    
      -%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%:     
       %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%.     
       %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%:     
       %%%%#-:.:=*%%%%%%%%%%%%%%%%%%%#*=-::=#%%%%%%%%%-     
       %%%%%*.     -%%%%%%%%%%%%%%%+.        #%%%%%%%%-     
       %%%%%%%+.     :+#%%%%%%%%%%%%%#-      %%%%%%%%%-     
       %%%%%%%%%+       .=#%%%%%%%%%%%%%+:  :%%%%%%%%%:     
       %%%%%%%%%%%=        .=#%%%%%%%%%%%%%+*%%%%%%%%-      
       %%%%%%%%%%%%%=         .=#%%%%%%%%%%%%%%%%%%%+       
      .%%%%%%%%%%%%%%%-          .=#%%%%%%%%%%%%%%%%%=      
       :%%%%%%%%%%%%%%%%-           .=#%%%%%%%%%%%%%%# 
      .%%%%%%%%%%%%%%%%%%%%#-             :#%%%%%%%%%+      
      :%%%%%%%%+%%%%%%%%%%%%%#-.             .=#%%%%%%:     
      .+%%%%%%- .+%%%%%%%%%%%%%#:               -%%%%%:     
       :%%%%%=    .+%%%%%%%%%%%%%#              =%%%%%-     
       -%%%%+       .+%%%%%%%%%%%%%=            %%%%%%-     
      :*%%%%-          =%%%%%%%%%%%%%=         *%%%%%%-     
      -%%%%%%#=.     :-+#%%%%%%%%%%%%%%=.     +%%%%%%%=     
      -%%%%%%%%%%**%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%=     
      -%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%=     
      -%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%=         
\033[0m
"""
dota = [
    "По приходу домой с учебного заведения ты видишь игру Dota 2.",
    "Ты заходишь в нее и понимаешь, что ты не такой как все и выбираешь режим турбо.",
    "Но раз уж ты не такой как все, ты пикаешь в турбо Пуджа.",
    "И вот начинается великое сражение."
]
print(b)
print(a)

warrior1 = Warrior("Пудж")
warrior2 = Warrior("Джагернаут")
for line in dota:
    print(line)
    time.sleep(1)
while True:
    attacker = random.choice([warrior1, warrior2])
    defender = warrior2 if attacker == warrior1 else warrior1

    if not attacker.attack(defender):
        break

    time.sleep(1)